
#input არის რაც კომპიუტერში შედის
#output არის რაც იგზავნება კომპიუტერიდან
#კონკატინაციას ვუწოდებთ როდესაც ციფრები მატემატიკურ მოქმედებას არ აკეთებენ

name=input("გთხოვთ შეიყვანოთ სახელი")

name = input("შეიყვანეთ თქვენი სახელი: ")
username = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")
addres = input("შეიყვანეთ საცხოვრებელი ადგილი: ")
color = input("შეიყვანეთ თქვენი საყვარელი ფერი: ")
car = input("შეიყვანეთ თქვენი საყვარელი მანქანა: ")


print("გამარჯობა, მე ვარ " + name +   username + " ვარ " + age + " წლის. "
      "ვცხოვრობ " + addres + "-ში. ჩემი საყვარელი ფერია " + color + 
      " და ჩემი საყვარელი მანქანაა " + car )
s1 =(int)("5")
s2 =(int) ("25")
s3 =(int) ("100")
s4 =(int) ("7")
s5 =(int)("50")

a =(str) (12)
b = (str)(34)
c = (str)(99)
d = (str)(5)
e = (str)(60)
num = int(input("შეიყვანეთ ნებისმიერი რიცხვი: "))


gazrda = num + 15


print("თქვენი რიცხვი +15 =", gazrda)