#2) შექმენით სამი ცვლადი num1, num2 და num3, შემდეგ კი დაპრინტეთ მათი ჯამი.

number1= 69
number2= 89
number3= 79
print(number1+number2+number3)

#3) შექმენით ორი ცვლადი x, y, თქვენი დავალებაა გამოიტანოთ ამ ცვლადების ჯამი.

x=5
y=10
print(x+y)

#4) შექმენით ორი ცვლადი length და width(მართკუთხედის გვერდები),
# მიანიჭეთ მნიშვნელობებად 20 და 10.გამოითვალეთ მართკუთხედის
# პერიმეტრი და შემდეგ კი დაპრინტეთ პასუხი termianl-ში.

length=20
width=10 
perimeter = 2 * (length+width)
print(perimeter)


 #5) გააკეთეთ 5-5 მაგალითი ყველა მათემატიკურ ოპერაციებზე.

print(2 * 2)
print(2/2)
print(2-8)
print(10+30)
print(5//3)