# 1) Flowchart - ეს  აჩვენებს ალგორითმის ნაბიჯებს
#     სიმბოლოებით და  როგორ უნდა იმუშაოს პროგრამამ.
#    Algorithm - ინსტრუქციების თანმიმდევრობა, რასაც კომპიუტერი ასრულებს.
#    Natural Language - ჩვეულებრივი ადამიანის ენა, რომლითაც ალგორითმს ვწერთ.
#    Pseudocode - ალგორითმის აღწერა უბრალო სიტყვებით და ცოტათი კოდთან მიახლოებულად.

# 2) Sequence - ეს არის მოქმედებების თანმიმდევრობა, რომელიც ერთი მეორის შემდეგ სრულდება.



# 3) Iteration - იგივე განმეორებაა, როცა ერთი და იგივე მოქმედება რამდენჯერმე კეთდება.
#    მაგ: დავბეჭდოთ რიცხვი 3-ჯერ
for i in range(3):
    print("გამეორება")  # iteration მაგალითი

# 4) Selection - როცა არჩევანი კეთდება პირობის მიხედვით.

# 5) 
for i in range(20):
 print("Gela")

# 6) 
for i in range(1, 11):
 print(i)

# 7)
for i in range(1, 51, 2):
 print(i)

# 8)
for i in range(2, 68, 2):
 print(i)
